#if !defined(QUESTIONS)
#define QUESTIONS

#include <vector>

#include "Question.hpp"

std::vector<Question> questions {
	{{"смелый", 0}, {"бдительный", 1}, {"предприимчивый", 2}, 1},
	{{"кроткий", 0}, {"робкий", 1}, {"упрямый", 2}, 2},
	{{"осторожный", 0}, {"решительный", 1}, {"пессимистичный", 2}, 3},
	{{"непостоянный", 0}, {"бесцеремонный", 1}, {"внимательный", 2}, 4},
	{{"неумный", 0}, {"трусливый", 1}, {"не думающий", 2}, 5},
	{{"ловкий", 0}, {"бойкий", 1}, {"удалой", 2}, 6},
	{{"хладнокровный", 0}, {"колеблющийся", 1}, {"удалой", 2}, 7},
	{{"стремительный", 0}, {"легкомысленный", 1}, {"боязливый", 2}, 8},
	{{"не задумывающийся", 0}, {"жеманный", 1}, {"непредусмотрительный", 2}, 9},
	{{"оптимистичный", 0}, {"добросовестный", 1}, {"чуткий", 2}, 10},
	{{"меланхоличный", 0}, {"сомневающийся", 1}, {"неустойчивый", 2}, 11},
	{{"трусливый", 0}, {"небрежный", 1}, {"взволнованный", 2}, 12},
	{{"опрометчивый", 0}, {"тихий", 1}, {"боязливый", 2}, 13},
	{{"внимательный", 0}, {"неблагоразумный", 1}, {"смелый", 2}, 14},
	{{"рассудительный", 0}, {"быстрый", 1}, {"мужественный", 2}, 15},
	{{"предприимчивый", 0}, {"осторожный", 1}, {"предусмотрительный", 2}, 16},
	{{"взволнованный", 0}, {"рассеянный", 1}, {"робкий", 2}, 17},
	{{"малодушный", 0}, {"неосторожный", 1}, {"бесцеремонный", 2}, 18},
	{{"пугливый", 0}, {"нерешительный", 1}, {"нервный", 2}, 19},
	{{"исполнительный", 0}, {"преданный", 1}, {"нервный", 2}, 20},
	{{"предусмотрительный", 0}, {"бойкий", 1}, {"отчаянный", 2}, 21},
	{{"укрощенный", 0}, {"безразличный", 1}, {"небрежный", 2}, 22},
	{{"осторожный", 0}, {"беззаботный", 1}, {"терпеливый", 2}, 23},
	{{"разумный", 0}, {"заботливый", 1}, {"храбрый", 2}, 24},
	{{"предвидящий", 0}, {"неустрашимый", 1}, {"добросовестный", 2}, 25},
	{{"поспешный", 0}, {"пугливый", 1}, {"беззаботный", 2}, 26},
	{{"рассеянный", 0}, {"опрометчивый", 1}, {"пессимистичный", 2}, 27},
	{{"осмотрительный", 0}, {"рассудительный", 1}, {"предприимчивый", 2}, 28},
	{{"тихий", 0}, {"неорганизованный", 1}, {"боязливый", 2}, 29},
	{{"оптимистичный", 0}, {"бдительный", 1}, {"беззаботный", 2}, 30}
};

#endif // QUESTIONS
