#if !defined(QUESTIONS)
#define QUESTIONS

#include <vector>

#include "Question.hpp"

std::vector<Question> questions {
	{"смелый", "бдительный", "предприимчивый", 1},
	{"кроткий", "робкий", "упрямый", 2},
	{"осторожный", "решительный", "пессимистичный", 3},
	{"непостоянный", "бесцеремонный", "внимательный", 4},
	{"неумный", "трусливый", "не думающий", 5},
	{"ловкий", "бойкий", "удалой", 6},
	{"хладнокровный", "колеблющийся", "удалой", 7},
	{"стремительный", "легкомысленный", "боязливый", 8},
	{"не задумывающийся", "жеманный", "непредусмотрительный", 9},
	{"оптимистичный", "добросовестный", "чуткий", 10},
	{"меланхоличный", "сомневающийся", "неустойчивый", 11},
	{"трусливый", "небрежный", "взволнованный", 12},
	{"опрометчивый", "тихий", "боязливый", 13},
	{"внимательный", "неблагоразумный", "смелый", 14},
	{"рассудительный", "быстрый", "мужественный", 15},
	{"предприимчивый", "осторожный", "предусмотрительный", 16},
	{"взволнованный", "рассеянный", "робкий", 17},
	{"малодушный", "неосторожный", "бесцеремонный", 18},
	{"пугливый", "нерешительный", "нервный", 19},
	{"исполнительный", "преданный", "нервный", 20},
	{"предусмотрительный", "бойкий", "отчаянный", 21},
	{"укрощенный", "безразличный", "небрежный", 22},
	{"осторожный", "беззаботный", "терпеливый", 23},
	{"разумный", "заботливый", "храбрый", 24},
	{"предвидящий", "неустрашимый", "добросовестный", 25},
	{"поспешный", "пугливый", "беззаботный", 26},
	{"рассеянный", "опрометчивый", "пессимистичный", 27},
	{"осмотрительный", "рассудительный", "предприимчивый", 28},
	{"тихий", "неорганизованный", "боязливый", 29},
	{"оптимистичный", "бдительный", "беззаботный", 30}
};

#endif // QUESTIONS
